Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMC20_DFP/1.1.156/samc20/edc/ATSAMC20J18A.PIC
      <edc:SFRDef edc:_addr="0x42004407" edc:access="r--rrrrr" edc:cname="SEQSTATUS" edc:impl="0x9F" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="ADC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC0">
            <edc:SFRFieldDef edc:cname="SEQSTATE" edc:desc="Sequence State" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="SEQBUSY" edc:desc="Sequence Busy" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42004408" edc:access="---nnnnn---nnnnn" edc:cname="INPUTCTRL" edc:impl="0x1F1F" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="ADC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC0">
            <edc:SFRFieldDef edc:cname="MUXPOS" edc:desc="Positive Mux Input Selection" edc:nzwidth="0x5">
              <edc:SFRFieldSemantic edc:cname="AIN0" edc:desc="ADC AIN0 Pin" edc:when="(field &amp; 0x1F) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="AIN1" edc:desc="ADC AIN1 Pin" edc:when="(field &amp; 0x1F) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="AIN2" edc:desc="ADC AIN2 Pin" edc:when="(field &amp; 0x1F) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="AIN3" edc:desc="ADC AIN3 Pin" edc:when="(field &amp; 0x1F) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="AIN4" edc:desc="ADC AIN4 Pin" edc:when="(field &amp; 0x1F) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="AIN5" edc:desc="ADC AIN5 Pin" edc:when="(field &amp; 0x1F) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="AIN6" edc:desc="ADC AIN6 Pin" edc:when="(field &amp; 0x1F) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="AIN7" edc:desc="ADC AIN7 Pin" edc:when="(field &amp; 0x1F) == 0x7"/>
              <edc:SFRFieldSemantic edc:cname="AIN8" edc:desc="ADC AIN8 Pin" edc:when="(field &amp; 0x1F) == 0x8"/>
              <edc:SFRFieldSemantic edc:cname="AIN9" edc:desc="ADC AIN9 Pin" edc:when="(field &amp; 0x1F) == 0x9"/>
              <edc:SFRFieldSemantic edc:cname="AIN10" edc:desc="ADC AIN10 Pin" edc:when="(field &amp; 0x1F) == 0xA"/>
              <edc:SFRFieldSemantic edc:cname="AIN11" edc:desc="ADC AIN11 Pin" edc:when="(field &amp; 0x1F) == 0xB"/>
              <edc:SFRFieldSemantic edc:cname="BANDGAP" edc:desc="Bandgap Voltage" edc:when="(field &amp; 0x1F) == 0x19"/>
              <edc:SFRFieldSemantic edc:cname="SCALEDCOREVCC" edc:desc="1/4 Scaled Core Supply" edc:when="(field &amp; 0x1F) == 0x1A"/>
              <edc:SFRFieldSemantic edc:cname="SCALEDIOVCC" edc:desc="1/4 Scaled I/O Supply" edc:when="(field &amp; 0x1F) == 0x1B"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="MUXNEG" edc:desc="Negative Mux Input Selection" edc:nzwidth="0x5">
              <edc:SFRFieldSemantic edc:cname="AIN0" edc:desc="ADC AIN0 Pin" edc:when="(field &amp; 0x1F) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="AIN1" edc:desc="ADC AIN1 Pin" edc:when="(field &amp; 0x1F) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="AIN2" edc:desc="ADC AIN2 Pin" edc:when="(field &amp; 0x1F) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="AIN3" edc:desc="ADC AIN3 Pin" edc:when="(field &amp; 0x1F) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="AIN4" edc:desc="ADC AIN4 Pin" edc:when="(field &amp; 0x1F) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="AIN5" edc:desc="ADC AIN5 Pin" edc:when="(field &amp; 0x1F) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="GND" edc:desc="Internal Ground" edc:when="(field &amp; 0x1F) == 0x18"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4200440A" edc:access="-----nnnn-nnnnnn" edc:cname="CTRLC" edc:impl="0x7BF" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="ADC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC0">
            <edc:SFRFieldDef edc:cname="DIFFMODE" edc:desc="Differential Mode" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LEFTADJ" edc:desc="Left-Adjusted Result" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FREERUN" edc:desc="Free Running Mode" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CORREN" edc:desc="Digital Correction Logic Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RESSEL" edc:desc="Conversion Result Resolution" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="12BIT" edc:desc="12-bit" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="16BIT" edc:desc="16-bit averaging mode" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="10BIT" edc:desc="10-bit" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="8BIT" edc:desc="8-bit" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="R2R" edc:desc="Rail-to-Rail mode enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WINMODE" edc:desc="Window Monitor Mode" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="No window mode (default)" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="MODE1" edc:desc="RESULT &gt; WINLT" edc:when="(field &amp; 0x7) == 1"/>
              <edc:SFRFieldSemantic edc:cname="MODE2" edc:desc="RESULT &lt; WINUT" edc:when="(field &amp; 0x7) == 2"/>
              <edc:SFRFieldSemantic edc:cname="MODE3" edc:desc="WINLT &lt; RESULT &lt; WINUT" edc:when="(field &amp; 0x7) == 3"/>
              <edc:SFRFieldSemantic edc:cname="MODE4" edc:desc="!(WINLT &lt; RESULT &lt; WINUT)" edc:when="(field &amp; 0x7) == 4"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4200440C" edc:access="-nnnnnnn" edc:cname="AVGCTRL" edc:impl="0x7F" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="ADC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC0">
            <edc:SFRFieldDef edc:cname="SAMPLENUM" edc:desc="Number of Samples to be Collected" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:cname="1" edc:desc="1 sample" edc:when="(field &amp; 0xF) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="2" edc:desc="2 samples" edc:when="(field &amp; 0xF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="4" edc:desc="4 samples" edc:when="(field &amp; 0xF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="8" edc:desc="8 samples" edc:when="(field &amp; 0xF) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="16" edc:desc="16 samples" edc:when="(field &amp; 0xF) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="32" edc:desc="32 samples" edc:when="(field &amp; 0xF) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="64" edc:desc="64 samples" edc:when="(field &amp; 0xF) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="128" edc:desc="128 samples" edc:when="(field &amp; 0xF) == 0x7"/>
              <edc:SFRFieldSemantic edc:cname="256" edc:desc="256 samples" edc:when="(field &amp; 0xF) == 0x8"/>
              <edc:SFRFieldSemantic edc:cname="512" edc:desc="512 samples" edc:when="(field &amp; 0xF) == 0x9"/>
              <edc:SFRFieldSemantic edc:cname="1024" edc:desc="1024 samples" edc:when="(field &amp; 0xF) == 0xA"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ADJRES" edc:desc="Adjusting Result / Division Coefficient" edc:nzwidth="0x3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4200440D" edc:access="n-nnnnnn" edc:cname="SAMPCTRL" edc:impl="0xBF" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="ADC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC0">
            <edc:SFRFieldDef edc:cname="SAMPLEN" edc:desc="Sampling Time Length" edc:nzwidth="0x6"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="OFFCOMP" edc:desc="Comparator Offset Compensation Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
